#+TITLE:神器中的神器 org-mode 之入门篇
#+STARTUP: fold

***** 内容元数据
      org-mode中有一下几种
      #+BEGIN_EXAMPLE
      s       #+beng_src ... #+end_src
      e       #+begin_example ... #+end_example
      q       #+begin_quote ... #+end_quote
      v       #+begin_verse ... #+end_verse
      c       #+begin_center ... #+end_center
      l       #+begin_latex ... #+end_latex
      L       #+latex:
      h       #+begin_html ... #+end_html
      H       #+html:
      a       #+begin_ascii ... #+end_ascii
      A       #+ascii:
      i       #+index: line
      I       #+include: line
      #+END_EXAMPLE

 + 代码
 上面的但字母作为快捷键，如输入一个<s然后tab后就变为
 #+BEGIN_EXAMPLE
 #+begin_src

 #+end_src
 #+END_EXAMPLE
 上面的代码我们还可以加入一些参数， 如
 #+BEGIN_EXAMPLE
 #+begin_src c -n -t -h 7 -w 40
 #+end_src
 c 为添加的语言
 -n 显示行号
 -t 清除格式
 -h 7 设置高度为7
 -w 40 设置宽度为40
 #+END_EXAMPLE
 + 注释
 以'#'开头的行都被看作注释，不会被到处取款注释采用如下写法
 #+BEGIN_EXAMPLE
 #+BEGIN_COMMENT
 ...
 #+END_COMMENT
 #+END_EXAMPLE
 + 表格与图片
 对于表格和图片，可以在前面增加标题和标签的说明， 以便交叉引用。比如在
 表格的前面添加：
 #+BEGIN_EXAMPLE
 #+CAPTION: This is the caption for the next table (or link)
 #+END_EXAMPLE
 则在需要的地方可以通过
 #+BEGIN_EXAMPLE
 \ref{table1}
 #+END_EXAMPLE
 来引用该表格
 + 嵌入html
 对于到处html以及发布，嵌入html代码就很有用。比如下面的例子使用与格式化
 为cnblogs的代码快
 #+BEGIN_EXAMPLE
 #+BEGIN_HTML html
 <div class="cnblogs_Highlighter">
 <pre class="brush::cpp">
 int main ()
 {
 return 0;
 }
 </pre>
 </div>
 #+END_EXAMPLE
 相当于在cnblogs的网页编辑器中插入"c++"代码
 + 包含文件
 当导出文档时，你可以包含其他文件中的内容。比如，想包含你的".emacs"文件，
 你可以用
 #+BEGIN_CENTER
 #+INCLUDE: "~/.emacs.d/init.el" src eamcs-lisp
 #+END_CENTER
 可选的第二个和第三个参数是组织方式(例如， "quote", "example", 或者
 "src"),如果是"src",语言用来格式化内容。 组织方式是可选的，如果不给出，
 文本会被当作Org模式的正常处理。用C-c,可以访问包含的文件
 #+INCLUDE: "~/.emacs.d/org/test.org" src emacs-lisp

#+BEGIN_SRC emacs-lisp :cache yes
  (format "%s" (buffer-file-name))
#+END_SRC

#+RESULTS[691a88cd3e7d919473d18cd6274b2d902dfa7f3f]:
: /home/lyt/.emacs.d/org/test.org



